#pragma once
typedef float vec_t;

typedef vec_t vec2_t[2];
typedef vec_t vec3_t[3];	
typedef vec_t vec4_t[4];	
typedef vec_t vec34_t[3][4];
typedef unsigned long dword;
#define KIND_PLAYER  1
#define KIND_MONSTER 2
#define KIND_NPC     4
#define KIND_TRAP    8

#define Vector(a,b,c,d) {(d)[0]=a;(d)[1]=b;(d)[2]=c;}
#define VectorAvg(a) ( ( (a)[0] + (a)[1] + (a)[2] ) / 3 )
#define VectorSubtract(a,b,c) {(c)[0]=(a)[0]-(b)[0];(c)[1]=(a)[1]-(b)[1];(c)[2]=(a)[2]-(b)[2];}
#define VectorAdd(a,b,c) {(c)[0]=(a)[0]+(b)[0];(c)[1]=(a)[1]+(b)[1];(c)[2]=(a)[2]+(b)[2];}
#define VectorCopy(a,b) {(b)[0]=(a)[0];(b)[1]=(a)[1];(b)[2]=(a)[2];}
#define QuaternionCopy(a,b) {(b)[0]=(a)[0];(b)[1]=(a)[1];(b)[2]=(a)[2];(b)[3]=(a)[3];}
#define VectorScale(a,b,c) {(c)[0]=(b)*(a)[0];(c)[1]=(b)*(a)[1];(c)[2]=(b)*(a)[2];}
#define DotProduct(x,y) ((x)[0]*(y)[0]+(x)[1]*(y)[1]+(x)[2]*(y)[2])
#define VectorFill(a,b) { (a)[0]=(b); (a)[1]=(b); (a)[2]=(b);}



#define assert(_Expression) (void)( (!!(_Expression)) || (_wassert(_CRT_WIDE(#_Expression), _CRT_WIDE(__FILE__), __LINE__), 0) )
_CRTIMP void __cdecl _wassert(_In_z_ const wchar_t * _Message, _In_z_ const wchar_t *_File, _In_ unsigned _Line);

#define TW_SAFEZONE									( 0x0001)
#define TW_SAFEZONE									( 0x0001)
#define TW_CHARACTER								( 0x0002)
#define TW_NOMOVE									( 0x0004)
#define TW_NOGROUND									( 0x0008)
#define TW_WATER									( 0x0010)
#define TW_ACTION									( 0x0020)
#define TW_HEIGHT									( 0x0040)

#define	CreateBarHP									((int(__stdcall*)(int PosX, int PosY, char * name, int currentLife, int MaxLife, bool a6)) 0x007DFA60)
#define	sub_7DFA60					                ((int(__stdcall*)(signed int PosX, signed int PosY, int a3, signed int a4, signed int a5, char a6)) 0x7DFA60)
#define Defineclass									((BYTE(__cdecl*)(BYTE userclass)) 0x00405230)
#define _GetSkinModelIndex							((char(__cdecl*)(char byClass)) 0x00587500)
#define PartyNumber									*(DWORD*)0x81F6B6C
#define IsPartyMember								((bool (__stdcall*)(int index))0x0051C5C0)
#define IsPartyMemberChar							((bool (__stdcall*)(int c))0x0051C5F0)
#define DeleteParts									((void(__cdecl*)(int c)) 0x004EFF70)
#define LevelConvert								((int(__cdecl*)(BYTE Level)) 0x0057FC30)

#define GetBaseClass									((BYTE(__cdecl*)(BYTE iClass)) 0x00405230)
#define GetStepClass									((BYTE(__cdecl*)(BYTE byClass)) 0x005875C0)
#define FontHeight										*(DWORD *)0x81C0380
//-- Utilidad PickUp

#define EnableUse										*(int*)0x8793738
#define EquipmentItem									*(bool*)0x81F6BEF
#define SendDropItem									*(DWORD*)0xE61FCC
#define SendGetItem										*(DWORD*)0xE61FC8
#define ms_pPickedItem									*(DWORD*)0x9816F7C
#define GetPickedItem									((int   (*)( )) 0x007DD0F0)
#define DeletePickedItem								((void  (*)( )) 0x007DD1B0)
#define GetOwnerInventory								((int (__thiscall*)(int Picket)) 0x007D9410)
#define PickedItem_CanMove								((bool (__thiscall*)(int m_pNewInventoryCtrl, int iTargetIndex, ITEM* pItemObj)) 0x007DC670)
#define pOwner_AddItem									((int (__thiscall*)(int thisa, int iColumnX, int iRowY, int pItem)) 0x007DA1F0)


//#define GetTargetLinealPos								((bool (__stdcall*)(int m_pNewInventoryCtrl)) 0x007D95E0)
#define HidePickedItem									((void (__thiscall*)(int pPickedItem)) 0x007D9660)
#define BackupPickedItem								((void (__thiscall*)( )) 0x007DD230)
#define CharacterMachine_Equipment( x )					*(DWORD*)0x8128AC4 + 107 * x + 4672

#define GetInventSourceLinealPos						((int(__stdcall*)(int thisa, int a2))0x0083C480)
#define GetInventSTargetLinealPos						((int(__thiscall*)(int thisa, int a2, int a3))0x0083C440)

#define GetTargetLinealPos								((int(__thiscall*)(WORD **thisa, void *a2))0x007D95E0)
#define GetSourceLinealPos								((int(__thiscall*)(int thisa))0x007D94E0)
#define CreateItemPick									((ITEM* (__stdcall*)(ITEM*)) 0x007E1E50)
#define SetPickItem										((bool  (__cdecl*)(int a4, const void *a5)) 0x007DD100)
#define CreatePickedItem								((bool(__cdecl*)(int a4, const void *a5)) 0x007DD100)

#define EmptyBufferString								((int (__thiscall*)(void* strMsg))0x00409AD0)
#define CreateOkMessageBox								((bool(__cdecl*)(LPVOID strMsg, DWORD dwColor, float fPriority)) 0x00790A10)
#define LoadWaveFile									((VOID(__cdecl*)(int Buffer, CHAR* strFileName, int MaxChannel, bool Enable)) 0x006D6800)
#define RenderPlane3D									((void(__cdecl*)(float Width,float Height,int Matrix)) 0x00636C90)
#define Link_Bone										((int(__thiscall*)(int o, int a2)) 0x004CD7F0)
#if(SLOTPET2 == 0)
typedef struct
{
	vec3_t StartPos;
	vec3_t XAxis;
	vec3_t YAxis;
	vec3_t ZAxis;
} OBB_t_ok;

typedef struct
{
	char Name[30];
	/*+30*/	bool TwoHand;
	/*+32*/	WORD Level;
	/*+34*/	BYTE m_byItemSlot;
	/*+36*/	WORD m_wSkillIndex;
	/*+38*/	BYTE Width;
	/*+39*/	BYTE Height;
	/*+40*/	short DamageMin;
	/*+41*/	short DamageMax;
	/*+42*/	BYTE SuccessfulBlocking;
	/*+43*/	short Defense;
	/*+44*/	BYTE MagicDefense;
	/*+45*/	BYTE WeaponSpeed;
	/*+46*/	BYTE WalkSpeed;
	/*+47*/	BYTE Durability;
	/*+48*/	BYTE MagicDur;
	/*+49*/	BYTE MagicPower;
	/*+50*/	WORD RequireStrength;
	/*+52*/	WORD RequireDexterity;
	/*+54*/	WORD RequireEnergy;
	/*+56*/	WORD  RequireVitality;
	/*+58*/	WORD RequireCharisma;
	/*+60*/	WORD RequireLevel;
	/*+62*/	BYTE Value;
	/*+64*/	int  iZen;
	/*+68*/	BYTE  AttType;
	/*+69*/	BYTE RequireClass[8];
	/*+77*/	BYTE Resistance[7];
} ITEM_ATTRIBUTE;

extern ITEM_ATTRIBUTE* ItemAttribute;

struct OBJECT
{
	BYTE arg[4];
	/*+4*/	bool          Live;
	/*+5*/	bool          bBillBoard;
	/*+6*/	bool          m_bCollisionCheck;		//  충돌 체크 할까?
	/*+7*/	bool          m_bRenderShadow;			//  그림자를 찍을까? 말까?
	/*+8*/	bool          EnableShadow;
	/*+9*/	bool		  LightEnable;
	/*+10*/	bool		  m_bActionStart;
	/*+11*/	bool		  m_bRenderAfterCharacter;
	/*+12*/	bool	      Visible;
	/*+13*/	bool	      AlphaEnable;
	/*+14*/	bool          EnableBoneMatrix;
	/*+15*/	bool		  ContrastEnable;
	/*+16*/	bool          ChromeEnable;
	/*+17*/	unsigned char AI;
	/*+18*/	unsigned short CurrentAction;
	/*+19*/	unsigned short PriorAction;
	/*+20*/		BYTE          ExtState;
	/*+21*/		BYTE          Teleport;
	/*+22*/		BYTE          Kind;
	/*+23*/		WORD		Skill;
	/*+24*/		BYTE		  m_byNumCloth;				// 천 개수
	/*+25*/		BYTE		  m_byHurtByOneToOne;
	/*+26*/		BYTE          WeaponLevel;
	/*+27*/		BYTE          DamageTime;				//  공격을 받은 충격 시간.
	/*+28*/		BYTE          m_byBuildTime;
	/*+29*/		BYTE		  m_bySkillCount;
	/*+30*/		BYTE		  m_bySkillSerialNum;
	/*+31*/		BYTE		  Block;
	/*+32*/	void* m_pCloth;	// 천 붙이기
	/*+40*/	short         ScreenX;
	/*+42*/	short         ScreenY;
	/*+44*/	short         PKKey;
	/*+46*/	short         Weapon;
	/*+48*/	int			  Type;
	/*+52*/	int           SubType;
	/*+56*/	int			  m_iAnimation;				// 펜릴 발바닥 관련 에니메이션 키값
	/*+60*/	int           HiddenMesh;
	/*+64*/	int           LifeTime;
	/*+68*/	int           BlendMesh;
	int           AttackPoint[2];
	int           RenderType;
	int			  InitialSceneFrame;
	int           LinkBone;
	/*92*/		DWORD		  m_dwTime;
	/*+96*/		float         Scale;
	/*+100*/	float         BlendMeshLight;
	/*+104*/	float         BlendMeshTexCoordU;
	/*+108*/	float         BlendMeshTexCoordV;
	/*+112*/	float         Timer;
	/*+116*/	float         m_fEdgeScale;				//  외곽선 스케일.	
	/*+120*/	float         Velocity;
	/*+124*/	float		  CollisionRange;
	/*+128*/	float         ShadowScale;
	/*+132*/	float         Gravity;
	/*+136*/	float         Distance;
	/*+140*/	float         AnimationFrame;
	/*+144*/	float         PriorAnimationFrame;
	/*+148*/	float	      AlphaTarget;
	/*+152*/	float         Alpha;
	vec3_t        Light;
	vec3_t        Direction;
	vec3_t		  m_vPosSword;				// 칼끝 위치
	vec3_t		  StartPosition;			// bullet
	vec3_t        BoundingBoxMin;
	vec3_t        BoundingBoxMax;
	vec3_t		  m_vDownAngle;
	vec3_t		  m_vDeadPosition;
	/*+252*/	vec3_t        Position;
	/*+264*/	vec3_t	 	  Angle;
	/*+276*/	vec3_t	 	  HeadAngle;
	/*+288*/	vec3_t	   	  HeadTargetAngle;
	/*+300*/	vec3_t  	  EyeLeft;
	/*+312*/	vec3_t  	  EyeRight;
	/*+324*/	vec3_t		  EyeLeft2;
	/*+336*/	vec3_t		  EyeRight2;
	/*+348*/	vec3_t		  EyeLeft3;
	/*+360*/	vec3_t		  EyeRight3;
	/*+372*/	vec34_t	 	  Matrix;
	vec34_t* BoneTrans;
	OBB_t_ok		  OBB;
	OBJECT* Owner;
	OBJECT* Prior;
	OBJECT* Next;
	BYTE		  m_BuffMap[134];
	short int	  m_sTargetIndex;
	BOOL		  m_bpcroom;
	vec3_t		  m_v3PrePos1;
	vec3_t		  m_v3PrePos2;
};

typedef struct //-> InDev (size: 1432)
{
	BYTE		byClass[5];
	bool        Blood;
	bool        Ride;
	bool        SkillSuccess;
	BOOL        m_bFixForm;
	bool        Foot[2];
	/*+14*/		bool	SafeZone;
	/*+15*/		bool	Change;
	/*+16*/		bool	HideShadow;
	/*+17*/		bool	m_bIsSelected;
	/*+18*/		bool	Decoy;
	/*+19*/		BYTE	Class;
	/*+20*/		BYTE	Skin;
	/*+21*/		BYTE	CtlCode;	//Bit decomposit (0x10)
	/*+22*/		BYTE	ExtendState;
	/*+23*/		BYTE	EtcPart;
	/*+24*/		BYTE	GuildStatus;
	/*+25*/		BYTE	GuildType;
	/*+26*/		BYTE	GuildRelationShip;
	/*+27*/		BYTE	GuildSkill;
	/*+28*/		BYTE	GuildMasterKillCount;
	/*+29*/		BYTE	BackupCurrentSkill;
	/*+30*/		BYTE	GuildTeam;
	/*+31*/		BYTE	m_byGensInfluence;	//0 - None, 1 - D, 2 - V
	/*+32*/		BYTE	PK;
	/*+33*/		char	PKPartyLevel;
	/*+34*/		BYTE	AttackFlag;
	/*+35*/		BYTE	AttackTime;
	/*+36*/		BYTE	TargetAngle;	//Personal Shop
	/*+37*/		BYTE	Dead;
	/*+40*/		WORD	Skill;
	/*+41*/		BYTE	SwordCount;
	/*+42*/		BYTE	byExtensionSkill;
	BYTE	m_byDieType;			//	죽는 형식.
	BYTE	StormTime;
	BYTE	JumpTime;
	/*+45*/		BYTE	RespawnPosX;
	/*+46*/		BYTE	RespawnPosY;
	BYTE    Appear;
	/*+50*/		BYTE	CurrentSkill;
	BYTE    CastRenderTime;
	BYTE    m_byFriend;
	WORD    MonsterSkill;
	/*+56*/		char    Name[32];	//need check size
	char 		Movement;
	BYTE gap06[30];
	/*+120*/	BYTE	Unknown120;
	/*+121*/	BYTE	Unknown121;
	BYTE gap07[2];
	/*+124*/	WORD	Unknown124;
	/*+126*/	WORD	aIndex;
	/*+128*/	WORD	TargetCharacter;
	/*+130*/	WORD	Decolorate;
	/*+132*/	WORD	ID;
	/*+134*/	WORD	Unknown134;
	/*+136*/	//maybe word
	BYTE gap09[36];
	/*+172*/	int		PositionX;
	/*+176*/	int		PositionY;
	BYTE gap10[8];
	/*+188*/	float	Unknown188;
	BYTE gap11[32];
	float	ProtectGuildMarkWorldTime;
	float	AttackRange;
	float	Freeze;
	float   Duplication;
	float	Rot;
	vec3_t  TargetPosition;
	vec3_t  Light;
	//--
	/*+268*/	short	Helm_Type;
	/*+270*/	BYTE	HelmLevel;
	/*+271*/	BYTE	HelmExcellent;
	/*+272*/	BYTE	HelmAncient;
	BYTE gap12[31];
	/*+304*/	short	Armor_Type;
	/*+306*/	BYTE	ArmorLevel;
	/*+307*/	BYTE	ArmorExcellent;
	/*+308*/	BYTE	ArmorAncient;
	BYTE gap13[31];
	/*+340*/	short	Pants_Type;
	/*+342*/	BYTE	PantsLevel;
	/*+343*/	BYTE	PantsExcellent;
	/*+344*/	BYTE	PantsAncient;
	BYTE gap14[31];
	/*+376*/	short	Gloves_Type;
	/*+378*/	BYTE	GlovesLevel;
	/*+379*/	BYTE	GlovesExcellent;
	/*+380*/	BYTE	GlovesAncient;
	BYTE gap15[31];
	/*+412*/	short	Boots_Type;
	/*+414*/	BYTE	BootsLevel;
	/*+415*/	BYTE	BootsExcellent;
	/*+416*/	BYTE	BootsAncient;
	BYTE gap16[31];
	/*+448*/	short	WeaponFirst_Type;
	/*+450*/	BYTE	WeaponFirstLevel;
	/*+451*/	BYTE	WeaponFirstExcellent;
	/*+452*/	BYTE	WeaponFirstAncient;
	BYTE gap17[31];
	/*+484*/	short	WeaponSecond_Type;
	/*+486*/	BYTE	WeaponSecondLevel;
	/*+487*/	BYTE	WeaponSecondExcellent;
	/*+488*/	BYTE	WeaponSecondAncient;
	BYTE gap18[31];
	/*+520*/	short	Wing_Type;
	/*+522*/	BYTE	Wing_Level;
	/*+523*/	BYTE	Wing_Option1;
	/*+524*/	BYTE	Wing_ExtOption;
	BYTE gap19[31];
	/*+556*/	short	Helper_Type;
	/*+558*/	BYTE	Helper_Level;
	/*+559*/	BYTE	Helper_Option1;
	/*+560*/	BYTE	Helper_ExtOption;
	BYTE	Helper_LinkBone;
	BYTE	Helper_CurrentAction;
	BYTE gap20[109];
	/*+672*/	DWORD	Unknown672;
	/*+676*/	DWORD	Unknown676;
	/*+680*/	DWORD	RavenSlot;
	BYTE gap21[80];
	/*+764*/	DWORD	Unknown764;
	BYTE gap22[8];
	/*+776*/	OBJECT	Object;
	/*+1424*/	BYTE	m_byRankIndex;	//maybe gens rank
	BYTE gap23[3];
	/*+1428*/	DWORD	Unknown1428;	//-> end
} CHARACTER_PRE, * CHARACTER;
#endif
enum VERTEX_POS { LT, LB, RB, RT, POS_MAX };
#pragma pack(push, 1)
typedef struct
{
	GLuint	BitmapIndex;
	char	FileName[MAX_BITMAP_FILE_NAME];
	float	Width;
	float	Height;
	char	Components;
	GLuint	TextureNumber;
	BYTE	Ref;
	BYTE*   Buffer;

private:
	friend class CBitmapCache;
	DWORD	dwCallCount;
} BITMAP_t;
#pragma pack(pop)

struct SScrCoord
{
	float	fX, fY;
};

struct STexCoord
{
	float	fTU, fTV;
};


char* GlobalTextx(int iNum);
void AngleMatrix_S6 (const vec3_t angles, float matrix[3][4] );
extern inline void GetNearRandomPos( vec3_t Pos, int iRange, vec3_t NewPos);
void VectorRotate_S6 (const vec3_t in1, const float in2[3][4], vec3_t out);
void RenderModel3D(float x, float y, float Width, float Height, int ItemID, int Level = 0, int Excl = 0, int Anc = 0, bool OnMouse = 0); // code hien thi item